In [101]:
print("hello")

hello

In [102]:
pip install openpyxl

In [4]:
import pandas as pd

In [5]:
df = pd.read_excel("Olympic Athletes.xlsx")

In [8]:
df.head(1)

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,United States,2008,2008-08-24,Swimming,8,0,0,8

In [106]:
df.head()

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,United States,2008,2008-08-24,Swimming,8,0,0,8
1,Michael Phelps,19.0,United States,2004,2004-08-29,Swimming,6,0,2,8
2,Michael Phelps,27.0,United States,2012,2012-08-12,Swimming,4,2,0,6
3,Natalie Coughlin,25.0,United States,2008,2008-08-24,Swimming,1,2,3,6
4,Aleksey Nemov,24.0,Russia,2000,2000-10-01,Gymnastics,2,1,3,6

In [107]:
df.tail()

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals
8613,Olena Sadovnycha,32.0,Ukraine,2000,2000-10-01,Archery,0,1,0,1
8614,Kateryna Serdiuk,17.0,Ukraine,2000,2000-10-01,Archery,0,1,0,1
8615,Wietse van Alten,21.0,Netherlands,2000,2000-10-01,Archery,0,0,1,1
8616,Sandra Wagner-Sachse,31.0,Germany,2000,2000-10-01,Archery,0,0,1,1
8617,Rod White,23.0,United States,2000,2000-10-01,Archery,0,0,1,1

In [12]:
df.sample(3)

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals
4867,Guus Vogels,25.0,Netherlands,2000,2000-10-01,Hockey,1,0,0,1
894,Namiq Abdullayev,29.0,Azerbaijan,2000,2000-10-01,Wrestling,1,0,0,1
1202,Layne Beaubien,32.0,United States,2008,2008-08-24,Waterpolo,0,1,0,1

In [10]:
df.size

86180

In [110]:
df.shape

(8618, 10)

In [111]:
df.columns

Index(['Athlete', 'Age', 'Country', 'Year', 'Closing Ceremony Date', 'Sport',
       'Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals'],
      dtype='object')

In [14]:
df[['Athlete','Country','Sport']]

                   Athlete        Country       Sport
0           Michael Phelps  United States    Swimming
1           Michael Phelps  United States    Swimming
2           Michael Phelps  United States    Swimming
3         Natalie Coughlin  United States    Swimming
4            Aleksey Nemov         Russia  Gymnastics
...                    ...            ...         ...
8613      Olena Sadovnycha        Ukraine     Archery
8614      Kateryna Serdiuk        Ukraine     Archery
8615      Wietse van Alten    Netherlands     Archery
8616  Sandra Wagner-Sachse        Germany     Archery
8617             Rod White  United States     Archery

[8618 rows x 3 columns]

### Getting the first five letters of the country and save it in a different column.

In [112]:
import numpy as np

In [113]:
df['First_five_letter_1'] = df['Country'].str.extract(r'(^w{5})')

In [114]:
# import pandas as pd

# # Assuming you have already read the data into the DataFrame 'df'

# # Extract the first five letters of the 'Country' column using a regex
# df['First_five_country'] = df['Country'].str.extract(r'^(.{5})')

# # Display the first few rows of the DataFrame to check the new column
# print(df.head())

###  Alternate Method

In [115]:
import pandas as pd

# Assuming you have already read the data into the DataFrame 'df'

# Extract the first five letters of the 'Country' column
df['First_five_country_2'] = df['Country'].str[:5]

# Display the first few rows of the DataFrame to check the new column
print(df.head())

            Athlete   Age        Country  Year Closing Ceremony Date  \
0    Michael Phelps  23.0  United States  2008            2008-08-24
1    Michael Phelps  19.0  United States  2004            2004-08-29
2    Michael Phelps  27.0  United States  2012            2012-08-12
3  Natalie Coughlin  25.0  United States  2008            2008-08-24
4     Aleksey Nemov  24.0         Russia  2000            2000-10-01

        Sport  Gold Medals  Silver Medals  Bronze Medals  Total Medals  \
0    Swimming            8              0              0             8
1    Swimming            6              0              2             8
2    Swimming            4              2              0             6
3    Swimming            1              2              3             6
4  Gymnastics            2              1              3             6

  First_five_letter_1 First_five_country_2
0                 NaN                Unite
1                 NaN                Unite
2                 NaN                Unite
3                 NaN                Unite
4                 NaN                Russi

In [116]:
df.columns

Index(['Athlete', 'Age', 'Country', 'Year', 'Closing Ceremony Date', 'Sport',
       'Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals',
       'First_five_letter_1', 'First_five_country_2'],
      dtype='object')

In [117]:
type(df)

pandas.core.frame.DataFrame

In [118]:
df['Country']

0       United States
1       United States
2       United States
3       United States
4              Russia
            ...
8613          Ukraine
8614          Ukraine
8615      Netherlands
8616          Germany
8617    United States
Name: Country, Length: 8618, dtype: object

In [119]:
df['First_five_country_2'].sample(5)

4500    Great
1884    Unite
2515    Nethe
6811    Ukrai
2763    Austr
Name: First_five_country_2, dtype: object

# Pandas Count:

First we are counting the countries starting with character ‘N’.
 It returns two elements but not newyork because the character ‘n’ here is in lower case. you can add both Upper and Lower case by using [Nn]
S=pd.Series([‘Norway','Colombi’,’Netherland','Japan','Puerto Rico','Russia’,’newyork'])
S[S.str.count(r’(^N.*)')==1]
We can use sum() function to find the total elements matching the pattern.
S.str.count(r’(^N.*)').sum()

In [120]:
import pandas as pd

S = pd.Series(['Norway', 'Colombia', 'Netherlands', 'Japan', 'Puerto Rico', 'Russia', 'New York'])

# Select elements in the Series where the pattern (^N.*) matches exactly once
result_series = S[S.str.count(r'(^N.*)') == 1]

# Display the result Series
print(result_series)

# Use sum() to find the total elements matching the pattern
total_matching_elements = S.str.count(r'(^N.*)').sum()
print("Total matching elements:", total_matching_elements)

0         Norway
2    Netherlands
6       New York
dtype: object
Total matching elements: 3

    The S[S.str.count(r'(^N.*)') == 1] line filters the elements in the Series S where the pattern (^N.*) (starting with 'N') matches exactly once.

    The S.str.count(r'(^N.*)').sum() line counts the occurrences of the pattern (^N.*) for each element in the Series and then sums those counts to get the total number of elements that match the pattern.

Note: Ensure that your pattern and data match your specific use case. The provided pattern assumes you are looking for elements in the Series that start with the letter 'N'.

### Pandas Match

match () function is equivalent to python’s re.match() and returns a boolean value. We are finding all the countries in pandas series starting with character ‘P’ (Upper case) .
        
        Get countries starting with letter P

In [20]:
# import pandas as pd

S = pd.Series(['Finland', 'Colombia', 'Florida', 'Japan', 'Puerto Rico', 'Russia', 'France'])

# Select elements in the Series where the values start with 'P'
# result_series = S[S.str.match(r'^P.*')]
result_series = S[S.str.endswith(r'^*a')]


# Display the result Series
print(result_series)

Series([], dtype: object)

    S.str.match(r'^P.*') creates a boolean Series indicating whether each element starts with 'P'.
    S[S.str.match(r'^P.*')] filters the original Series (S) based on this condition.

Make sure your actual data and pattern match your specific use case. The provided pattern assumes you are looking for elements in the Series that start with the letter 'P'.

In [122]:
df[df['Athlete'].str.match('^P.*')== True]

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals,First_five_letter_1,First_five_country_2
20,Petria Thomas,28.0,Australia,2004,2004-08-29,Swimming,3,1,0,4,NaN,Austr
27,Pieter van den Hoogenband,22.0,Netherlands,2000,2000-10-01,Swimming,2,0,2,4,NaN,Nethe
33,Petter Northug Jr.,24.0,Norway,2010,2010-02-28,Cross Country Skiing,2,1,1,4,NaN,Norwa
58,Pang Jiaying,23.0,China,2008,2008-08-24,Swimming,0,1,2,3,NaN,China
79,Pieter van den Hoogenband,26.0,Netherlands,2004,2004-08-29,Swimming,1,2,0,3,NaN,Nethe
...,...,...,...,...,...,...,...,...,...,...,...,...
8217,Pat Dwyer,26.0,Australia,2004,2004-08-29,Athletics,0,1,0,1,NaN,Austr
8255,Paul Kipsiele Koech,22.0,Kenya,2004,2004-08-29,Athletics,0,0,1,1,NaN,Kenya
8465,Passion Richardson,25.0,United States,2000,2000-10-01,Athletics,0,0,1,1,NaN,Unite
8487,Paul Tergat,31.0,Kenya,2000,2000-10-01,Athletics,0,1,0,1,NaN,Kenya
8592,Park Gyeong-Mo,28.0,South Korea,2004,2004-08-29,Archery,1,0,0,1,NaN,South

### Pandas Replace

Replaces all the occurence of matched pattern in the string. We want to remove the dash(-) followed by number in the below pandas series object. 


The regex checks for a dash(-) followed by a numeric digit (represented by d) and replace that with an empty string and the inplace parameter set as True will update the existing series. The output is list of countres without the dash and number.

In [123]:
import pandas as pd

S = pd.Series(['Finland-1', 'Colombia-2', 'Florida-3', 'Japan-4', 'Puerto Rico-5', 'Russia-6', 'France-7'])

# Replace the pattern '(-\d)' with an empty string
S.replace('(-\d)', '', regex=True, inplace=True)

# Display the modified Series
print(S)

0        Finland
1       Colombia
2        Florida
3          Japan
4    Puerto Rico
5         Russia
6         France
dtype: object

<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
C:\Users\VIJAY\AppData\Local\Temp\ipykernel_28280\957912210.py:6: SyntaxWarning: invalid escape sequence '\d'
  S.replace('(-\d)', '', regex=True, inplace=True)

# Below two block are the alternate codes for the previous code.

In [124]:
import pandas as pd

S = pd.Series(['Finland-1', 'Colombia-2', 'Florida-3', 'Japan-4', 'Puerto Rico-5', 'Russia-6', 'France-7'])

# Replace the pattern '(-\d)' with an empty string
S.replace(r'(-\d)', '', regex=True, inplace=True)

# Display the modified Series
print(S)

0        Finland
1       Colombia
2        Florida
3          Japan
4    Puerto Rico
5         Russia
6         France
dtype: object

In [125]:
import pandas as pd

S = pd.Series(['Finland-1', 'Colombia-2', 'Florida-3', 'Japan-4', 'Puerto Rico-5', 'Russia-6', 'France-7'])

# Replace the pattern '(-\\d)' with an empty string
S.replace('(-\\d)', '', regex=True, inplace=True)

# Display the modified Series
print(S)

0        Finland
1       Colombia
2        Florida
3          Japan
4    Puerto Rico
5         Russia
6         France
dtype: object

### Pandas Findall

It calls re.findall() and find all occurence of matching patterns. 


We are creating a new list of countries which starts with character ‘F’ and ‘f’ from the Series. 


The list comprehension checks for all the returned value > 0 and creates a list matching the patterns.

In [126]:
import pandas as pd

S = pd.Series(['Finland', 'Colombia', 'Florida', 'Japan', 'Puerto Rico', 'Russia', 'France'])

# Extract elements that start with 'F' or 'f'
result_list = [itm[0] for itm in S.str.findall('^[Ff].*') if len(itm) > 0]

# Display the result list
print(result_list)

['Finland', 'Florida', 'France']

    S.str.findall('^[Ff].*'): Uses findall to find all occurrences of strings that start with 'F' or 'f' in each element of the Series.
    [itm[0] for itm in ... if len(itm) > 0]: List comprehension that extracts the first element from each match (if it exists) and filters out empty lists.
    The result is a list containing the elements that start with 'F' or 'f'.

### Pandas Contains

It uses re.search() and returns a boolean value.

In the below regex we are looking for all the countries starting with character ‘F’ (using start with metacharacter ^) in the pandas series object. 

The result shows True for all countries start with character ‘F’ and False which doesn’t.

In [127]:
import pandas as pd

S = pd.Series(['Finland', 'Colombia', 'Florida', 'Japan', 'Puerto Rico', 'Russia', 'France'])

# Check if each element starts with 'F'
result_series = S.str.contains('^F.*')

# Display the result Series
print(result_series)

0     True
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

### elements at positions 0, 2, and 6 start with 'F', so the corresponding values in the result Series are True, and the others are False.

In our original dataframe we will filter all the countries starting with character ‘I’ . We just need to filter all the True values that is returned by contains() function.

In [128]:
df[df['Country'].str.contains('^I.*')==True]

,Athlete,Age,Country,Year,Closing Ceremony Date,Sport,Gold Medals,Silver Medals,Bronze Medals,Total Medals,First_five_letter_1,First_five_country_2
83,Massimiliano Rosolino,22.0,Italy,2000,2000-10-01,Swimming,1,1,1,3,NaN,Italy
97,Enrico Fabris,24.0,Italy,2006,2006-02-26,Speed Skating,2,0,1,3,NaN,Italy
129,Stefania Belmondo,33.0,Italy,2002,2002-02-24,Cross Country Skiing,1,1,1,3,NaN,Italy
264,Domenico Fioravanti,23.0,Italy,2000,2000-10-01,Swimming,2,0,0,2,NaN,Italy
337,Niccolò Campriani,24.0,Italy,2012,2012-08-12,Shooting,1,1,0,2,NaN,Italy
...,...,...,...,...,...,...,...,...,...,...,...,...
8578,Mauro Nespoli,20.0,Italy,2008,2008-08-24,Archery,0,1,0,1,NaN,Italy
8585,Marco Galiazzo,21.0,Italy,2004,2004-08-29,Archery,1,0,0,1,NaN,Italy
8602,Matteo Bisiani,24.0,Italy,2000,2000-10-01,Archery,0,1,0,1,NaN,Italy
8604,Ilario Di Buò,43.0,Italy,2000,2000-10-01,Archery,0,1,0,1,NaN,Italy
8606,Michele Frangilli,24.0,Italy,2000,2000-10-01,Archery,0,1,0,1,NaN,Italy